# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model - Lightweight version with attention + RepC3 + BiFPN
# Optimized for ~2.6M parameters (original: 2.59M)

# Parameters
nc: 9 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

#===================轻量版: 注意力+RepC3+BiFPN 开始===================
# Backbone: 只加2层轻量注意力 (ECA + CoordAtt)
backbone:
 - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
 - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
 - [-1, 1, C3k2, [256, False, 0.1]] # 2 ← n=1, e=0.1
 - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
 - [-1, 1, C3k2, [512, False, 0.1]] # 4 ← n=1, e=0.1
 - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
 - [-1, 1, C3k2, [512, True, 0.2]] # 6 ← n=1, e=0.2
 - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
 - [-1, 1, C3k2, [1024, True, 0.2]] # 8 ← n=1, e=0.2
 - [-1, 1, SPPF, [1024, 5]] # 9
 - [-1, 1, C2PSA, [1024]] # 10 ← n=1

head:
 - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
 - [[-1, 6], 1, Concat, [1]] # 12
 - [-1, 1, C3k2, [512, False, 0.1]] # 13 ← n=1

 - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
 - [[-1, 4], 1, Concat, [1]] # 15
 - [-1, 1, C3k2, [256, False, 0.1]] # 16 (P3/8-small) ← n=1

 - [-1, 1, Conv, [256, 3, 2]]
 - [[-1, 13], 1, BiFPN_Add2, [512]] # 18 ← BiFPN保留
 - [-1, 1, C3k2, [512, False, 0.1]] # 19 (P4/16-medium) ← n=1

 - [-1, 1, Conv, [512, 3, 2]]
 - [[-1, 10], 1, BiFPN_Add2, [1024]] # 21 ← BiFPN保留
 - [-1, 1, RepC3, [1024]] # 22 (P5/32-large) ← RepC3保留, n=1

 - [[16, 19, 22], 1, Detect, [nc]]
#===================轻量版结束===================
